Public Attributes | List of all members
API_MeshQuantity Struct Reference
Element Manager API
Describes the different calculated values for meshes. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | bottomSurface
bottom surface of the mesh
double  | topSurface
top surface of the mesh
double  | edgeSurface
surface of the edge of the mesh
double  | volume
volume of the mesh
double  | perimeter
perimeter of the mesh
double  | holesSurf
total area of holes in the mesh
double  | holesPrm
total perimeter of holes in the mesh
double  | projectedArea
projected area of the mesh
Detailed Description
Describes the different calculated values for meshes.
Remarks
See also the mesh parameters for listing in Appendix A of the GDL Reference manual.
Member Data Documentation
◆ bottomSurface
 API_MeshQuantity::bottomSurface
bottom surface of the mesh
◆ edgeSurface
 API_MeshQuantity::edgeSurface
surface of the edge of the mesh
◆ holesPrm
 API_MeshQuantity::holesPrm
total perimeter of holes in the mesh
◆ holesSurf
 API_MeshQuantity::holesSurf
total area of holes in the mesh
◆ perimeter
 API_MeshQuantity::perimeter
perimeter of the mesh
◆ projectedArea
 API_MeshQuantity::projectedArea
projected area of the mesh
◆ topSurface
 API_MeshQuantity::topSurface
top surface of the mesh
◆ volume
 API_MeshQuantity::volume
volume of the mesh